# Episode 03: "Паттерны во времени"
## Season 1: Foundations

> *"В хаосе всегда есть порядок. Нужно лишь научиться его видеть..."*

---

## 🎬 BRIEFING

**Локация:** Ваша квартира, Москва  
**Время:** 03:47, глубокая ночь  
**Статус:** 🔴 Pattern Detected

Данные из Episode 02 классифицированы. Но это только начало.

Анализируя временные метки, вы замечаете странную закономерность: координаты появляются через определённые интервалы. Не случайные, а строго периодичные. Как будто кто-то передаёт сигнал по расписанию.

Вы пишете скрипт для анализа паттернов... и находите нечто большее.

**Последовательность координат формирует маршрут.** Маршрут ведёт к серверу в московском дата-центре.

Но чтобы вычислить точное местоположение, нужно проанализировать тысячи записей. Вручную не получится. Нужны циклы.

**Ваша задача:** Написать программу для поиска и анализа паттернов в данных.

---

## 📚 THEORY

### 1. Циклы — повторение действий

Программы часто должны делать одно и то же много раз. Для этого есть **циклы**.

#### Цикл for

Используется, когда **заранее известно** сколько раз нужно повторить:

```c
for (int i = 0; i < 10; i++) {
    printf("%d ", i);  // Выведет: 0 1 2 3 4 5 6 7 8 9
}
```

**Структура:**
```c
for (инициализация; условие; шаг) {
    // код
}
```

1. **Инициализация** — выполняется один раз в начале
2. **Условие** — проверяется перед каждой итерацией
3. **Тело цикла** — выполняется, если условие истинно
4. **Шаг** — выполняется после каждой итерации

**Метафора:** Конвейер с известным числом шагов. Счётчик `i` — позиция на конвейере.

---

#### Цикл while

Используется, когда **неизвестно заранее** сколько итераций:

```c
int i = 0;
while (i < 10) {
    printf("%d ", i);
    i++;
}
```

**Метафора:** Охранник у двери — пропускает, пока условие истинно.

**Важно:** Условие проверяется **перед** входом в цикл!

---

#### Цикл do-while

Как while, но выполняется **минимум один раз**:

```c
int i = 0;
do {
    printf("%d ", i);
    i++;
} while (i < 10);
```

**Разница:** Условие проверяется **после** выполнения тела.

**Когда использовать:** Когда нужно выполнить хотя бы раз (например, меню программы).

---

### 2. Управление циклами

#### break — выход из цикла

```c
for (int i = 0; i < 100; i++) {
    if (i == 5) {
        break;  // Выход из цикла при i == 5
    }
    printf("%d ", i);  // 0 1 2 3 4
}
```

**Метафора:** Аварийный выход.

#### continue — пропустить итерацию

```c
for (int i = 0; i < 10; i++) {
    if (i % 2 == 0) {
        continue;  // Пропустить чётные
    }
    printf("%d ", i);  // 1 3 5 7 9
}
```

**Метафора:** Перейти к следующему элементу конвейера.

---

### 3. Вложенные циклы

Циклы внутри циклов — для многомерных данных:

```c
// Таблица умножения
for (int i = 1; i <= 3; i++) {
    for (int j = 1; j <= 3; j++) {
        printf("%d×%d=%d  ", i, j, i*j);
    }
    printf("\n");
}
```

**Вывод:**
```
1×1=1  1×2=2  1×3=3  
2×1=2  2×2=4  2×3=6  
3×1=3  3×2=6  3×3=9  
```

**Метафора:** Матрёшка — циклы вложены друг в друга.

**Важно:** Внешний цикл = строки, внутренний = столбцы.

---

### 4. Бесконечные циклы

#### Преднамеренные:
```c
while (1) {  // или for (;;)
    // Бесконечный цикл (для серверов, игр)
    if (условие_выхода) break;
}
```

#### Случайные (баги):
```c
for (int i = 0; i < 10; i--) {  // БАГ! i уменьшается!
    printf("%d ", i);  // Бесконечный цикл!
}
```

**Как остановить:** Ctrl+C в терминале.

---

### 5. Паттерны поиска

#### Линейный поиск:
```c
int arr[] = {10, 20, 30, 40, 50};
int target = 30;
int found = -1;

for (int i = 0; i < 5; i++) {
    if (arr[i] == target) {
        found = i;
        break;
    }
}

if (found != -1) {
    printf("Найдено на позиции %d\n", found);
}
```

#### Поиск максимума:
```c
int arr[] = {3, 7, 2, 9, 1};
int max = arr[0];

for (int i = 1; i < 5; i++) {
    if (arr[i] > max) {
        max = arr[i];
    }
}

printf("Максимум: %d\n", max);
```

---

## 🎯 MISSION

### Данные

Файл содержит тысячи временных меток и координат. Формат:
```
timestamp latitude longitude
1234567890 55.7558 37.6173
1234567900 55.7560 37.6180
...
```

---

### Задача 1: pattern_finder.c

**Цель:** Найти периодичность в данных

1. Прочитать все временные метки
2. Вычислить интервалы между последовательными метками
3. Найти самый частый интервал (это период передачи)
4. Вывести паттерн

**Подсказка:** Используйте массив для хранения интервалов, затем найдите моду (самое частое значение).

---

### Задача 2: sequence_analyzer.c

**Цель:** Проанализировать последовательность координат

1. Прочитать координаты в массив
2. Вычислить расстояния между последовательными точками
3. Найти среднее расстояние
4. Найти аномалии (расстояния > 2× среднего)

**Формула расстояния** (упрощённая для малых дистанций):
```c
float distance = sqrt(pow(lat2 - lat1, 2) + pow(lon2 - lon1, 2)) * 111.0;
// × 111 км/градус для приблизительного перевода
```

---

### Задача 3: bruteforce.c (Challenge)

**Цель:** Брутфорс-поиск ключа

В данных спрятан 4-значный PIN-код. Метод: контрольная сумма всех байт координат по модулю 10000.

1. Перебрать все варианты от 0000 до 9999
2. Для каждого варианта вычислить контрольную сумму
3. Сравнить с эталонной (дана в конце файла)
4. Найти совпадение = PIN найден

**Примечание:** Это учебный пример брутфорса. Реальные системы используют более сложную защиту!

---

## 📝 Структура файлов

```
episode-03-patterns-in-time/
├── README.md           ← Вы здесь
├── mission.md          
├── data.txt            ← Входные данные
├── starter.c           
├── artifacts/
│   ├── pattern_finder.c
│   ├── sequence_analyzer.c
│   └── bruteforce.c
└── tests/
    └── test.sh
```

---

## 🛠 Компиляция

```bash
# Pattern finder
gcc -Wall -Wextra -std=c11 -o pattern artifacts/pattern_finder.c

# Sequence analyzer
gcc -Wall -Wextra -std=c11 -lm -o sequence artifacts/sequence_analyzer.c
# -lm нужен для math.h (sqrt, pow)

# Bruteforce
gcc -Wall -Wextra -std=c11 -o bruteforce artifacts/bruteforce.c
```

---

## 💡 Подсказки

### Подсказка 1: Чтение до EOF
```c
long timestamp;
float lat, lon;

while (scanf("%ld %f %f", &timestamp, &lat, &lon) == 3) {
    // Обработка
}
```

### Подсказка 2: Массив для счётчиков
```c
int intervals[1000] = {0};  // Счётчики для каждого интервала

// После вычисления interval
if (interval < 1000) {
    intervals[interval]++;
}
```

### Подсказка 3: Поиск максимума в массиве
```c
int max_count = 0;
int most_frequent = 0;

for (int i = 0; i < 1000; i++) {
    if (intervals[i] > max_count) {
        max_count = intervals[i];
        most_frequent = i;
    }
}
```

---

## 🎓 Что вы изучите

✅ Цикл `for` (когда известно количество итераций)  
✅ Цикл `while` (условный цикл)  
✅ Цикл `do-while` (минимум одна итерация)  
✅ `break` и `continue`  
✅ Вложенные циклы  
✅ Поиск паттернов в данных  
✅ Простой брутфорс  

---

## 🎬 DEBRIEFING

> *Содержимое появится после прохождения эпизода*

**Что вы найдёте:**
- Период передачи сигнала
- Маршрут через координаты
- PIN-код доступа к серверу

**Status:** 🟢 Mission Ready  
**Next:** Episode 04 - "Первый инструмент"

---

## 🎨 Easter Eggs

🔍 **Отсылки:**
- Поиск паттернов — как в "Beautiful Mind" (фильм про математика)
- Брутфорс PIN — классика из хакерских фильмов
- Анализ последовательностей — методы из "Шерлока"

---

**Найдите паттерн, агент. Время не ждёт.**

```
// PATTERN ANALYSIS MODULE
// SEARCHING FOR ANOMALIES...
// READY TO EXECUTE
```
