# Episode 02: "Цепочка зацепок"
## Season 1: Foundations

> *"Данные говорят, но нужно научиться их слушать..."*

---

## 🎬 BRIEFING

**Локация:** Ваша квартира, Москва  
**Время:** 01:23, глубокая ночь  
**Статус:** 🟡 Analysis in Progress

Сообщение Виктора расшифровано. "MOONLIGHT activated. They know. Files at old place. Trust only code."

"Старое место" — это не физическая локация. Это протокол, который вы разработали вместе с Виктором три года назад для обмена файлами через скрытый канал в сети.

Вы запускаете старый скрипт подключения. Через несколько минут загружается файл — `data.dat`. Внутри — список координат, временных меток и неких идентификаторов.

Но данные сырые, неструктурированные. Нужно их классифицировать и понять, что они означают.

**Ваша задача:** Написать программу для анализа и классификации данных.

---

## 📚 THEORY

### 1. Условные операторы (if/else)

Программы должны принимать решения на основе условий.

```c
int temperature = 25;

if (temperature > 30) {
    printf("Жарко!\n");
} else if (temperature > 20) {
    printf("Комфортно\n");
} else {
    printf("Холодно\n");
}
```

**Метафора:** Развилка дорог. В зависимости от условия, программа идёт разными путями.

#### Операторы сравнения:
```c
a == b  // равно
a != b  // не равно
a > b   // больше
a < b   // меньше
a >= b  // больше или равно
a <= b  // меньше или равно
```

⚠️ **Частая ошибка:**
```c
if (x = 5) { ... }  // НЕПРАВИЛЬНО! Присваивание, не сравнение!
if (x == 5) { ... } // Правильно
```

---

### 2. Логические операторы

Комбинируйте условия:

```c
int age = 25;
int has_license = 1;  // 1 = true, 0 = false

// AND (&&) - оба условия должны быть истинны
if (age >= 18 && has_license) {
    printf("Можете водить\n");
}

// OR (||) - хотя бы одно условие истинно
if (age < 18 || !has_license) {
    printf("Нельзя водить\n");
}

// NOT (!) - инвертирует условие
if (!has_license) {
    printf("Нет прав\n");
}
```

**Таблицы истинности:**
```
AND (&&):           OR (||):          NOT (!):
0 && 0 = 0          0 || 0 = 0        !0 = 1
0 && 1 = 0          0 || 1 = 1        !1 = 0
1 && 0 = 0          1 || 0 = 1
1 && 1 = 1          1 || 1 = 1
```

---

### 3. Switch statement

Когда много вариантов:

```c
int day = 3;

switch (day) {
    case 1:
        printf("Понедельник\n");
        break;
    case 2:
        printf("Вторник\n");
        break;
    case 3:
        printf("Среда\n");
        break;
    // ...
    default:
        printf("Неизвестный день\n");
}
```

**Важно:** `break` обязателен! Иначе код провалится в следующий case.

**Метафора:** Диспетчер на вокзале направляет поезд на нужную платформу.

---

### 4. Тернарный оператор

Краткая форма if/else для простых случаев:

```c
int age = 20;
char *status = (age >= 18) ? "adult" : "minor";

// Эквивалентно:
char *status;
if (age >= 18) {
    status = "adult";
} else {
    status = "minor";
}
```

**Синтаксис:** `условие ? значение_если_истина : значение_если_ложь`

---

### 5. Валидация данных

Всегда проверяйте входные данные!

```c
float latitude, longitude;
printf("Enter coordinates: ");
scanf("%f %f", &latitude, &longitude);

// Валидация
if (latitude < -90.0 || latitude > 90.0) {
    printf("Invalid latitude!\n");
    return 1;
}

if (longitude < -180.0 || longitude > 180.0) {
    printf("Invalid longitude!\n");
    return 1;
}

printf("Valid coordinates: %.2f, %.2f\n", latitude, longitude);
```

---

## 🎯 MISSION

### Данные из файла

Файл содержит записи в формате:
```
<type> <value1> <value2> <timestamp>
```

**Типы:**
- `C` - Coordinate (широта, долгота)
- `T` - Time (часы, минуты)
- `I` - ID (числовой идентификатор)

**Примеры:**
```
C 55.7558 37.6173 1234567890
T 14 30 1234567891
I 42 0 1234567892
C -33.8688 151.2093 1234567900
```

---

### Задача 1: classifier.c

**Цель:** Классификация записей по типам

Напишите программу, которая:
1. Читает записи
2. Определяет тип
3. Проверяет валидность данных
4. Выводит статистику

**Валидация:**
- Координаты: lat ∈ [-90, 90], lon ∈ [-180, 180]
- Время: hours ∈ [0, 23], minutes ∈ [0, 59]
- ID: любое положительное число

---

### Задача 2: router.c

**Цель:** Маршрутизация данных по категориям

На основе данных определить:
- Координаты в Москве (55.0-56.0 N, 36.0-38.0 E)
- Координаты в других странах
- Время: день (06:00-18:00) или ночь
- ID: чётные / нечётные

Вывести каждую запись в соответствующую категорию.

---

### Задача 3: pattern_finder.c (Preview для Episode 03)

**Цель:** Найти связь между записями

Найти:
- Сколько координат в одном городе
- Есть ли повторяющиеся временные метки
- Какие ID встречаются чаще всего

---

## 📝 Структура

```
episode-02-chain-of-clues/
├── README.md
├── mission.md
├── data.dat              ← Входные данные
├── starter.c
├── artifacts/
│   ├── classifier.c      ← Ваш код
│   ├── router.c
│   └── pattern_finder.c
└── tests/
    └── test.sh
```

---

## 🛠 Компиляция

```bash
gcc -Wall -Wextra -std=c11 -o classifier artifacts/classifier.c
./classifier < data.dat
```

---

## 💡 Подсказки

<details>
<summary>Hint 1: Чтение типа записи</summary>

```c
char type;
scanf(" %c", &type);  // Пробел перед %c игнорирует whitespace
```
</details>

<details>
<summary>Hint 2: Switch для типов</summary>

```c
switch (type) {
    case 'C':
        // Обработка координат
        break;
    case 'T':
        // Обработка времени
        break;
    // ...
}
```
</details>

---

## 🎓 Что вы изучите

✅ Условные операторы (`if`, `else`)  
✅ Switch statement  
✅ Логические операторы  
✅ Тернарный оператор  
✅ Валидация данных  
✅ Чтение структурированных данных  

---

## 🎬 DEBRIEFING

> *Содержимое появится после прохождения эпизода*

**Status:** 🟢 Mission Ready  
**Next:** Episode 03 - "Паттерны во времени"

---

*— Данные не случайны. Всё имеет смысл. Нужно лишь найти ключ...*
